ЕРПУХАстенд.cbr_Основной/src/DataProcessors/cbr_РеестрТМЦ/cbr_РеестрТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>cbr_РеестрТМЦ</name>
  <comment>//++ ШмелевР 02.02.2026 ЗКП.16</comment>
  <attributes>
    <name>ДатаЗаписиПлановойЦены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВключенияВДействующиеТехКарты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.cbr_Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяЧистаяЦена</name>
    <comment>не понятно что это</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьиРасходовДляРасчета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаРасчетов</name>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяЦенаТекущегоКварталаРуб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц7</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц8</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц9</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияМесяц11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсторияИзмененияКрайняяЗакупка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДрайверЦены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортВЦенеЧистаЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СредняяЦенаОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ABCВРазререКатегории</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВключенИндексВАктуальнуюТехКарту</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДнейБезДвижения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.cbr_Статусы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокВРезерве</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВЗаказахУПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВАктуальныхЗаказахУПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлавноваяЦенаБудущегоКвартала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СвободныйОстатокШТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АВС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласован</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаЦО</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ЕРПУХАстенд.cbr_Основной/src/DataProcessors/cbr_РеестрТМЦ/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

#Если Не ТолстыйКлиентУправляемоеПриложение И НЕ ТолстыйКлиентОбычноеПриложение  Тогда
Процедура ПолучениеДанныхКЗаполениюИзСКД(Параметры) Экспорт
	МакетСКД = ПолучитьМакет("СКДФормированиеДанныхДляЗаполненияТаблицы");
	СхемаКомпоновкиДанных = МакетСКД;
	КомпоновщикНастроекТЗ = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекТЗ.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	ВариантОтчета = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("Основной");
	КомпоновщикНастроекТЗ.ЗагрузитьНастройки(ВариантОтчета.Настройки);
	НастройкиКомпоновщика = КомпоновщикНастроекТЗ.Настройки;
	ПараметрыНастройки = НастройкиКомпоновщика.ПараметрыДанных;
	
	ПараметрНачалоПериода = ПараметрыНастройки.Элементы.Найти("НачалоПериода");
	ПараметрНачалоПериода.Значение = Параметры.НачалоПериода;
	ПараметрНачалоПериода.Использование = Истина;
	
	ПараметрКонецПериода = ПараметрыНастройки.Элементы.Найти("КонецПериода");
	ПараметрКонецПериода.Значение = Параметры.КонецПериода;
	ПараметрКонецПериода.Использование = Истина;	
	
	Если Параметры.Свойство("НоменклатураОтборы") и ЗначениеЗаполнено(Параметры.НоменклатураОтборы) Тогда
		НастройкиДляЗаполнения = НастройкиКомпоновщика.Отбор.Элементы;
		НовыйЭлементНастроек = НастройкиДляЗаполнения.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементНастроек.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
		НовыйЭлементНастроек.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		НовыйЭлементНастроек.ПравоеЗначение = Параметры.НоменклатураОтборы;
	КонецЕсли;
	Если Параметры.Свойство("ВидЦены") и ЗначениеЗаполнено(Параметры.ВидЦены) Тогда
		НастройкиДляЗаполнения = НастройкиКомпоновщика.Отбор.Элементы;
		НовыйЭлементНастроек = НастройкиДляЗаполнения.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементНастроек.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидЦены");
		НовыйЭлементНастроек.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементНастроек.ПравоеЗначение = Параметры.ВидЦены;
	КонецЕсли;
	Если Параметры.Свойство("ТранспортнаяЧистаяЦена") и ЗначениеЗаполнено(Параметры.ТранспортнаяЧистаяЦена) Тогда
		НастройкиДляЗаполнения = НастройкиКомпоновщика.Отбор.Элементы;
		НовыйЭлементНастроек = НастройкиДляЗаполнения.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементНастроек.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТранспортнаяЧистаяЦена");
		НовыйЭлементНастроек.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементНастроек.ПравоеЗначение = Параметры.ТранспортнаяЧистаяЦена;
	КонецЕсли;
	Если Параметры.Свойство("Статус") и ЗначениеЗаполнено(Параметры.Статус) Тогда
		НастройкиДляЗаполнения = НастройкиКомпоновщика.Отбор.Элементы;
		НовыйЭлементНастроек = НастройкиДляЗаполнения.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементНастроек.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
		НовыйЭлементНастроек.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементНастроек.ПравоеЗначение = Параметры.Статус;
	КонецЕсли;
	Если Параметры.Свойство("ПризнакВключенияВДействующиеТехКарты") и ЗначениеЗаполнено(Параметры.ПризнакВключенияВДействующиеТехКарты) Тогда
		НастройкиДляЗаполнения = НастройкиКомпоновщика.Отбор.Элементы;
		НовыйЭлементНастроек = НастройкиДляЗаполнения.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементНастроек.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПризнакВключенияВДействующиеТехКарты");
		НовыйЭлементНастроек.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементНастроек.ПравоеЗначение = Параметры.ПризнакВключенияВДействующиеТехКарты;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	Процессор = Новый ПроцессорКомпоновкиДанных;
	Процессор.Инициализировать(МакетКомпоновкиДанных);
	
	ТаблицаКВыводу = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаКВыводу);
	ПроцессорВывода.Вывести(Процессор);
	
	Параметры.ТаблицаРасчетов = ТаблицаКВыводу;
КонецПроцедуры 

Процедура СоздатьДокумент(Параметры) Экспорт
	ДокументУстановкаЦенНоменклатуры = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ДокументУстановкаЦенНоменклатуры, Параметры);
	
	Для каждого ЭлементТЧ из Параметры.ТаблицаРасчетов Цикл
		НоваяСтрока = ДокументУстановкаЦенНоменклатуры.Товары2_5.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементТЧ);
		НоваяСтрока.Цена = ЭлементТЧ.ПлавноваяЦенаБудущегоКвартала;
	КонецЦикла;
	
	НоваяСтрока = ДокументУстановкаЦенНоменклатуры.ВидыЦен.Добавить();
	НоваяСтрока.ВидЦены = Параметры.ВидЦены;
	НоваяСтрока.НастройкиКомпоновкиДанных = Параметры.НастройкиКомпоновкиДанных;
	Попытка
		ДокументУстановкаЦенНоменклатуры.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КОнецПопытки;
КонецПроцедуры

#КонецЕсли
#КонецОбласти
